{
  "product_id": "1942499888",
  "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
  "product_name": null,
  "reviews": [
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Better than my over priced mattress",
      "review_text": "Great bed, especially for the price! This shipped super fast. It is super heavy so make sure you have help or you're not taking it too far. I ordered this for the guest house at my Dads. The mattress in there was tagged April 2022, it's older than my daughter. This arrived mattress in 3 days. It set up fast. I slept like a baby, and I have a very expensive mattress at home. I'm looking at a king for my house now. I think this is better than my $3,500 mattress…insanity!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9334,
      "score": 0.9667,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Pleasantly surprised",
      "review_text": "After months of sleeping on an air mattress and watching countless review videos, my husband chose this bed. So far, after two sleepings, he loves it. The bed arrived packed inside the box better than anything g we've ever received. Once the many layers of plastic were removed, the bed began to expand. It took about 8 hours for it to achieve its maximum size. We ordered the 14”, but it's actually 13”. In the event we would need to return the bed, it is impossible to put it back in its box. Hopefully, this will continue to be a good purchase and serve us well.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9482,
      "score": 0.9741,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Very happy 😊 repeat Allswell customer",
      "review_text": "This is my second Allswell mattress, and I love it! The firmness is perfect for my back, as a person in my 50's, and a RN, I am very particular about my sleep situation. This first mattress I purchased was the brick (the firmest you can get) a few years ago and ended up putting the cooling foam topper and cloud quilted topper on it, also from Walmart/Allswell. The firmness level was perfect for my back but needed a little extra cushioning for my knees. This combination made my dream bed 🛌 😴. Still use this to this day!!! My most recent purchase was the supreme mattress, and it has a cooling attached topper, which is a must for Arizona 🌵🔥!!! This is in a guest room and the comfort level is perfect!!! I am so happy with the affordability and comfort of both purchases and will be back for sure, this is my go to mattress place now. Thank you Allswell 😊",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9777,
      "score": 0.9888,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "No hip pain!",
      "review_text": "Exceptional value! I bought the cooling cover feature, and was very impressed. Slept through the night with minimal tossing and turning. we are side sleepers and this mattress makes you feel comfortable and refreshed in the morning.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.976,
      "score": 0.988,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "It came very quickly. I let it air out for a day and put it on the bed. It replaced a mattress that was \"custom made\" and cost about $800 more. I slept very well and no more back pain!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.862,
      "score": 0.931,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "I had slept on an Allswell mattress at an AirB%26B. I later inquired to the owner and she said I wasn't the first to ask her. We have been very pleased with the comfort and support of our mattress. Since it has coils, I can feel a slight amount of movement when my husband gets up, but not always and just slightly. We had an all foam mattress before which was comfy but less support after a few years. I do recommend this mattress, especially for the price point!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.8448,
      "score": 0.9224,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "DISCOMFORT MATTRESS FOR SLIM INDIVIDUALS",
      "review_text": "Not good for people under 300 pounds, side or back sleepers. You would have terrible discomfort though the nights. I was always unable to walk for a few minutes getting out of bed everymorning.. l never had such awful discomfort using this mattress. Good quality, good price. Terrible support for slim people.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.9178,
      "score": 0.0411,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Don't waste your money",
      "review_text": "It's literally the worst mattress I have ever wasted money on. I bought this one specifically because it's supposed to be cooling, and I retain heat while sleeping. The mattress gets so hot so quickly that I would wake up thinking I had a fever from how hot my skin was. There is no support at all. The matress sinks in the middle, and I consistently wake up with pain in my back and hips. I would have been better off flushing a few hundred dollars down the toilet.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.9449,
      "score": 0.0276,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Very disappointed",
      "review_text": "Was not able to use the mattress because it came damaged by the shipper. Having a hard time trying to return it because Im supposed to return it the store. I am senior in age and I am having a hard time moving the extremely damaged box. I live in an apartment complex and had to pay someone to move from the lobby to upstairs in my apartment. Walmart was not sensitive to my dilemma.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.9061,
      "score": 0.0469,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "matress box was seriously damaged during transport. it was wet from rain, dirty, and the top was open. The men who deivered it were driving an open bed pickup truck. All this makes me the opposite of happy. I really have to ask. Are these matresses \"seconds\" that couldn't be sold elsewhere ? I ask because the stitching is very uneven, almost as if a child did it. there are many wrinkles on the top of the matress that haven't settled out after sitting undisturbed for more than 24 hours. many wrinkles along both sides that are not settling out. i can submit photos if you like. let me know how we can fix this....??.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8396,
      "score": 0.0802,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "I don't know about the mattress yet.It is still setting out It did not come with any paperwork.Only the mattress itself no warranty.No paperwork of any kind no instructions plus it is delivered to the wrong house",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8675,
      "score": 0.0662,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Chiropractor approved",
      "review_text": "[This review was collected as part of a promotion.] As a chiropractor, I can tell you that this is a very comfortable and supportive bed. I must say I was skeptical buying a bed online and without testing it. And I am so happy that I did. I have had some of the best night's sleep since purchasing this mattress. Easy to set up, just make sure there is at least one other person to help because the box is heavy.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9689,
      "score": 0.9845,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Excellent in every way",
      "review_text": "I was a skeptic buying a mattress from a company that was new to me. My skepticism was heightened when I found out that they were going to send this to me in a box, rolled up. I have bought other mattresses (e.g. Ikea) in a rolled up form and was not terribly impressed though it worked. My experience with the Allswell Supreme has truly changed my opinions and settled all of my skepticism. The package is heavy. There was no white glove delivery option due to COVID19. The shipping company (FedEx) driver was very careless and rough, destroyed the box. I complained to them for the treatment of the package. Thankfully the mattress itself was undamaged and was wrapped well inside. Getting it up the stairs was quite a feat, it is heavy and awkward. Once it was laid out on our box springs, it was extremely easy. Open up the package and let it air out for 48 hours and it was amazing! The mattress is very comfortable and hugs you a minute after you lay down. It is not an uncomfortable hug but just enough, the springs do not allow for a full sink in, it is perfect. The bed does not get hot at night. The sheets do have to be deep pocket sheets, the mattress is 14 inches. I woke up the next morning for the first time in years without pain in my shoulders and hips (side-sleeper). My fitbit recordings of my sleep have been excellent. My wife and I are so thankful we bought this mattress. It was incredibly reasonable with the Pre-Christmas sale that was running. Value price, Incredible quality, excellent product. I would recommend this to anyone. This mattress may have put my physical therapist and chiropractor out of business.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "neutral",
      "confidence": 0.4122,
      "score": 0.5,
      "roberta_label": "neutral",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "The Best of Both Worlds!",
      "review_text": "We've only had this bed for a short while, but so far we love it. We had slept on a memory foam mattress for the last three years, but we find the hybrid to more comfortable. That little extra \"give\" of the individually wrapped coils is just what we were looking for!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9768,
      "score": 0.9884,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "Allswell that Endswell. Great ending to the day when you know you are going to sleep on your new Allswell Supreme Mattress the same day you unbox it. My goodness is it nice. Unboxed on top of our box spring, and unrolled plastic wrap forever. Cut the plastic wrap covering the bed itself, and in (2) hours my wife was taking her noontime nappy. Now this is someone who many years ago could smell a dirty diaper from three rooms away. So that is evidence that we experienced little to no off airing of the mattress. Living in FL we did have the luxury of opening our bedroom windows to air out any unpleasant odor. Our first night sleeping on this bed was just wonderful. If you have any reservations about purchasing this bed, forget about it, and order now. Our bed did not come with handles; however, when unboxing on the box springs they are not necessary. Goodnight as Allswell.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9392,
      "score": 0.9696,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Firm to the 9",
      "review_text": "[This review was collected as part of a promotion.] Very solid and sturdy mattress, however it is extremely firm for my wife and I. We are both almost 30 and have never felt sore after sleeping in a bed until the first time we slept in the Supreme King. We woke up the first day after having the mattress and were sore all over and couldn't believe it. Continued to sleep on it for the recommended three weeks with no improved comfort. Customer service was great in the return process though.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.817,
      "score": 0.9085,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great customer service",
      "review_text": "We received our Supreme Queen on a Friday night. When unwrapping, the plastic covering didn't come off easily.. turns out the plastic had melted on top the of mattress. As you can imagine, I was really disappointed because I knew being a Friday, there was no way this would get resolved until Monday. We ended up sleeping on the mattress through the weekend and loved how comfortable it was! With a mattress covering and sheets, we weren't as bothered by the melted plastic. I sent an email to customer service, but never heard back, so I called Tuesday morning. Was never put on hold, was answered by the sweetest representative right away. She was able to pull up the pictures that I sent in my email and assured me this has never happened in the past. She placed a new order and we received another Supreme mattress that Friday. This time no melted plastic! It's been about a month now, and my husband and I LOVE our new mattress. Not sure how this will last for years to come, but right now, we are very happy with our purchase and the Allswell customer service. For reference, I'm 118lb side sleeper, and my husband is 170lbs sleeps on side and back. I also sleep very hot (we live in FL) and this mattress is much cooler than our previous memory foam mattress.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.3509,
      "score": 0.6755,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Awesome product, but not for us!",
      "review_text": "Don't let my 4 star rating (instead of a 5) mislead you. The Supreme Cal King mattress is an awesome product as well as an incredible value. This was my first experience with an on-line mattress and a \"Bed-in-a-Box\". My wife and I had no idea what to expect. The box came in severely damaged and we assumed the mattress would be damaged as well. The abundant wrapping and bagging protected the mattress from suffering any damage from the freight company mishandling. Because of the Covid-19 restrictions, the white glove option wasn't available. This means we had to remove our 20 year old traditional mattress and replace it with the new one ourselves. This was easier than I thought, but not for the feint of heart. The 'trick' is to place the bagged, compressed mattress in place and open an entire end of the mattress bag. the mattress will decompress and you can incrementally work the bag off of the mattress. Sadly, we didn't have the mattress oriented properly, so we had to turn the mattress. This wasn't excessively difficult. It's difficult to to select a mattress on-line. We need a firmer mattress so we thought a medium to firm rating would suffice. Sadly, this wasn't the case. Keep in mind, the firmness ratings differ from retailer to retailer. A firm rating at one site seems to be a medium at another. Another consideration is a hybrid mattress (springs and foam) is quite different from an older traditional mattress. The foam takes some getting used to. To my dismay, this isn't something I could adjust to, even after more than two weeks on the mattress. I'm a tall person with back and knee issues. The foam supported my entire body, but didn't offer the overall alignment I need to prevent back pain. Perhaps one of the other mattresses could, but as an old dog that's not ready for new tricks, I think I'm going to stick with a more traditional mattress. I still think the quality of the mattress is surprisingly good, and the value is spectacular. If you are of normal height and weight, this could be the mattress for you.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.6415,
      "score": 0.8208,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Wonderful value, but a tad soft",
      "review_text": "Terrific value. Nice mattress. It's just a tad soft for my taste. The description is \"medium firm\". I didn't dare go any more firm because I don't care for too firm a mattress. From my perspective I might describe it as medium. I'm pretty happy overall with it, and will likely adjust with no complaints. The edge stiffness is wonderful and accommodates sitting on the edge of the bed nicely. It's one of the perils of on-line shopping/ordering. With no real option to \"test\" you kind of live with what you get, since returning a mattress is WAY to much of an ordeal.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.8938,
      "score": 0.9469,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "The Supreme-King",
      "review_text": "I'm still in the infancy stage with The Supreme-King. This is my first mattress with memory foam and is definitely an adjustment but it's been positive so far. Sinking into it every night still catches me off guard but it's enjoyable. I am primarily a stomach and side sleeper and even though my body type is more on the slim side the mattress has suited me well. I am looking towards more nights on this mattress.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9169,
      "score": 0.9584,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "My son loves his new bed!",
      "review_text": "My son is thrilled with his new bed. It's become harder to get him out of it in the morning :). The whole experience with Allswell was great! The ordering was easy; the selections weren't complicated to choose from; shipping was easy to track and the order arrived quickly. All-in-all a great experience. Thanks, Allswell!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9856,
      "score": 0.9928,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great mattress, two noteworthy qualities",
      "review_text": "There were two notable qualities in this mattress that pleased me very much. The first was the overall feel of the mattress. I have always needed a topper with previous mattresses, but not with this one, it was perfect out of the box. If you are looking for something really firm, this may not be for you, but for all others I would say try it. Most comfortable mattress I have ever used. The second pleasant surprise was the complete lack of any noticeable off-gassing, something which I really don't like. Right out of the box this mattress was as neutral as any organic brand. Overall super-pleased, happy to give 5 star review, telling all my friends.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9723,
      "score": 0.9862,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Years of back pain is helped by Allswell Spreme",
      "review_text": "Purchased this mattress after visiting my brother. He had a Queen size in his quest room. I have had a back problem for years in 2011 I had to have rods and pins placed L2-L5. This helped for a few years and due to scare tissue when they tried to place a stimulator they had problems and the stimulator surgery was half done. At my brother's house I would wake up with little pain but during the day I had to use assistance to walk, but because of my ability to sleep and wake up with very little pain I had to own one. Great investment!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.7019,
      "score": 0.8509,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "FIRM MATTRESS Hard to see why it's called a \"Hybrid\"",
      "review_text": "I got this mattress because I needed a good hybrid between firm and plush and went with the 14\" for height and thickness since I wasn't going to be using a box spring. This mattress is FIRM and it's difficult to see why they call this a \"hybrid.\" I had my roommate sit on it and my boyfriend slept on it and they both agree that it is too firm. The memory foam on top only kicks in a while after you've sat on it, but it's barely any give. The height is perfect and the material is nice but I just can't work with how firm it is. Even when you punch the bed, it is SUPER hard. After the first night I woke up completely sore but I thought it was from moving into my new apartment. But now, it has been a full week and I am buying a memory foam mattress topper because 1) I don't want to go through the hassle of returning this and 2) I don't want to have to research and wait to get a different one. Only get this mattress if you are looking for FIRM support.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.5644,
      "score": 0.2178,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Queen Supreme mattress",
      "review_text": "Very comfortable so far! The only thing I don't love, is that the top cover never fully got tight, so now it doesn't lay flat, and parts of it stick up or make a bump. We let it fully inflate for a full 48 hrs before sleeping on it too, so I was hoping it would lay flat, but unfortunately it was still a loose top.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.3572,
      "score": 0.3214,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Comfortable and supportive",
      "review_text": "Our mattress arrived on time and the set up was simple. (Recommend having 2 people to get this mattress in to place due to its weight and size) when the mattress expands quickly when released from the 2nd bag that it is packaged in. We did not notice any chemical odors and were able to begin enjoy sleeping on this mattress the same day that we set it up. Our mattress is both comfortable and supportive. I sleep comfortably in many positions. My wife is very satisfied as well",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.8821,
      "score": 0.941,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Enjoying good nights Sleep",
      "review_text": "I been sleeping on this mattress for just over a week and so far I am very pleased with it. Firmness and support are meeting my expectations and I am sleeping comfortably with no issues similar to the ones I had with a 5 year old Memory foam Mattress. Very satisfied with my purchase .",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9778,
      "score": 0.9889,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Supreme King",
      "review_text": "[This review was collected as part of a promotion.] The bed is comfortable. The edges of the bed are pretty soft. Could use more structure around the edges. Major disappointment was when we took the bed out of the bag. There was a major stain in the quilted top.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.7571,
      "score": 0.8786,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Terrific mattress for a good price.",
      "review_text": "I am pleased with this mattress, it is very comfortable and spacious. I sleep like a baby. I haven't had any issues with getting hot and sweaty bec it is a hybrid not just a foam mattress. Walmart makes these and I know they wouldn't put their name behind them if they were inferior. Also I know Walmart would make it right if the mattress didn't work out, Everyone is different but for me this has been a great purchase.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9563,
      "score": 0.9782,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great mattress",
      "review_text": "[This review was collected as part of a promotion.] So far so good. 1 week in, I am sleeping very well. We were used to a foam topper, so my almost 50 y.o. body does have a bit more of a push back in the morning (and we can always add the topper back); however, I stay asleep very easily and also it is NOT hot in any way. If you run hot at night, this is an excellent option. We are very happy with it.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9615,
      "score": 0.9807,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Too firm, not enough edge support",
      "review_text": "[This review was collected as part of a promotion.] I've been sleeping on the Allswell Supreme for more than I month, and I'm probably going to return it--mostly because it's firm enough that I'm still waking up with sore hips and shoulders. I'm also disappointed in the edge support; I feel like I'm going to roll out of bed when my dog crowds me over to the edge.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8472,
      "score": 0.0764,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "3 Mattresses in One Month",
      "review_text": "[This review was collected as part of a promotion.] We bought our first Allswell Mattress a month ago for our new second home. Felt a little weird ordering online because it was our first time ordering a mattress through the web (but it's now a trend). We received our Allswell Supreme mattress on time. Set it up. Had the best sleep in a long time. A week later we ordered another Allswell mattress (Luxe) for our guest room. After sleeping on the Supreme mattress for a month, we decided to get a third Allswell mattress (Supreme) for our first home. Now, I'm telling all my friends about Allswell mattress. Thank you!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.7412,
      "score": 0.8706,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Middle of the road comfort",
      "review_text": "The mattress is fairly supportive but is only slightly better than our 13-yr old worn out mattress. Back support is better, pressure points not as severe but still exist. It wasn't magical by any means. My concern is how long will it last before it's just as painful as our old one. Probably not 13 years.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "neutral",
      "confidence": 0.4628,
      "score": 0.5,
      "roberta_label": "neutral",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Allswell Supreme",
      "review_text": "The bed is comfortable, however is much hotter than previous mattress' I have owned. Part of the reason I purchased this mattress was it said it transfers heat away, yet I feel much hotter than ever. The top also ripples up and creates a bump on or bunch of material that is hard to smooth out. But, the bed itself is comfortable and I don't wake up sore or aching.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.8505,
      "score": 0.9252,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Should have known.",
      "review_text": "This is definitely a plush mattress. I don't know who would think this is firm- the website lists it as a 6, but I'd call it a 3. As soon as you sit on it, you sink right in. It's not so plush that you're sore in the morning, but it's plush enough that changing sleeping positions happens way less than on a firmer, more supportive bed. I opted to return using their free mattress pick up service, and instead they refunded me and made removal my problem, instructing me to donate or discard. Not a cool move, since getting rid of it now costs me money when half their value proposition is a risk-free trial.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.4751,
      "score": 0.7375,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "queen supreme",
      "review_text": "this is a great mattress. at first, it is a cozy, firm feel as you hop on to the mattress & with the heat of your body you sink in for a restful night of sleep. sadly for our mature bodies, this sinking into the mattress feel of memory foam mattresses only exacerbates our aches & pains.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9269,
      "score": 0.9635,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "MoJo",
      "review_text": "Been sleeping on our King Supreme for a couple of weeks. I notice the top layer forms “ridges” or bunches up while I sleep. I can smooth it out in the morning and it doesn't seem to interfere with my sleep, but I'm not pleased that it does this. Also I bought sheets to fit a 14 inch mattress, but they are loose. Not sure it the mattress really is 14 inches. I like the bottom fitted sheet to be snug but it is “loose” when I put it on. Mattress felt more “firm” initially and I think is getting softer the more we sleep on it. Is this possible after a few weeks? That is fine with me as I wanted something a less firm and with a soft top feel. Overall, I would not return it, but wanted to give this feedback, since you asked!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.5906,
      "score": 0.2047,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Comfy no more sleepless nights",
      "review_text": "Best decision we made. What a relief for my back issues. I am finally getting some sleep 4 mattresses later.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9302,
      "score": 0.9651,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "No support",
      "review_text": "The bed is too soft. There is no support and my neck is killing me. I'm trying to figure out how to return it.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.9179,
      "score": 0.041,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "This is the 4th allswell king we've purchased. We've purchased queen and twins also. So comfortable!!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9494,
      "score": 0.9747,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great bed!",
      "review_text": "We really love this bed! It had been recommended to us by a couple of our friends and it was definitely a good buy and a quality bed. Would highly recommend.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9893,
      "score": 0.9947,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Supreme King",
      "review_text": "The mattress is advertised a medium firmness and feels great. The mattress has good motion isolation. However, the edges of the mattress are sub-standard. The edges do not hold well in my opinion. Overall, I would purchase this mattress again.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.6197,
      "score": 0.8098,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "Everything was excellent. The only issue was the condition of the packaging. It was torn on all sides to where I could see the product inside. Luckily the product was not damaged.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.5931,
      "score": 0.7965,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Firm as a rock. Don't buy, save your back.",
      "review_text": "This bed is as hard as a rock. I've slept on a bunch of mattresses in my life and I've never had issues with any of them, but this one is terrible. My girlfriend and I woke up multiple times for a whole week because our backs were so sore.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8915,
      "score": 0.0543,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Supreme King-perfect firm+softness",
      "review_text": "We've had our mattress for about 3 weeks and are very pleased. I like a really firm mattress and my husband the opposite and we've both loved it. It's soft enough for his liking, but you don't drown in it, like others I've hated. Very happy!!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9774,
      "score": 0.9887,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Worth every penny!",
      "review_text": "I was skeptical about this mattress but the quality speaks for itself - it is top notch. Just one night sleeping on this mattress helped alleviate my back pain. Way better than I ever imagined! I want to get one for every room in my house!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9769,
      "score": 0.9885,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Supreme King",
      "review_text": "Slightly soft, but mostly firm. If you're a side sleeper, you may need a thicker pillow to accommodate the mattress firmness. Love that I can't feel my husband move at night, though.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.5892,
      "score": 0.7946,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Cushier than expected",
      "review_text": "Not sure why I was expecting this to be on the firm side, but it is certainly not. If you like sinking into a mattress, this is for you! One star down because I feel like I have to climb out of the bed a little bit to turn over.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.5219,
      "score": 0.2391,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "5 stars",
      "review_text": "Very comfortable mattress, came rolled up. Opened the seal and let the air out and it formed into the king mattress we have now it's very durable and the edges hold my pregnant wife and I in on the mattress 5 out of 5 stars.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9353,
      "score": 0.9676,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Poor nights sleep. Woke in pain.",
      "review_text": "It was too soft for me. My body sunk into the temper pedic like toping and gave me a sore back in the morning. If u like a soft bed, u may like it but I woke with a pain in my back and neck.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8854,
      "score": 0.0573,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Comfort",
      "review_text": "My husband likes a firm mattress and I like a soft mattress so finding a happy medium has been tough for us, but with the Allswell supreme mattress, we did it! So so comfy! My hip pain is gone, too!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9608,
      "score": 0.9804,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "OH YEAH!!",
      "review_text": "This mattress supersedes my expectations of a bed in a box!! It is true to its measurements. it took about 48 hours maybe a little more to get to its full size. It is so comfortable i cant believe i paid what i paid for it. it is way better than the 2500 dollar mattress i had before.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9739,
      "score": 0.987,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "OMG",
      "review_text": "Needed a new mattress. Every night woke up with hip pain from arthritis. I'm a side sleeper but this would force me to lay on my back. Last night was the first time I did not have hip pain. My wife also said her back felt better. Great value for the price. Also box was okay on arrival.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.457,
      "score": 0.7285,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "Not the right bed for us. We bought this to replace one we had for 7yrs. In doing research it seems that hybrid is the way to go and really thought this was going to be good. Initially it was decent! Took a couple days to get used to but it was fine. Towards the end of the 30 days my back started hurting. I can't sleep on my stomach at all now without it hurting. My husband hasn't really liked it since the beginning but I guess we'll be dealing with it since the 30 day warranty is over.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.578,
      "score": 0.211,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Wonderful bed",
      "review_text": "Be warned, the bed is very very heavy. I'm grateful it was just a full size bed, but at 85 pounds is almost too much for one older person. After cutting off the plastic, it was bottom side up. Took a bit of maneuvering around for me to get it flipped. After having a memory foam bed for so long, it was unusual to have a bit of a bounce back. I had such a nice sleep. The mattress was the perfect mix of foam and coils. No big complaints, all are simple solutions. I will need a mattress protector to help with the slick top. The fitted sheet did slide around a bit.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.7735,
      "score": 0.8868,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Cali King superb",
      "review_text": "Great mattress, great delivery and easy to unbox. So comfortable and supportive",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9773,
      "score": 0.9887,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "Super comfortable! Reminds of the beds used by Wyndham",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9675,
      "score": 0.9837,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Happy with an overall excellent mattress",
      "review_text": "[This review was collected as part of a promotion.] Upgraded from an old spring mattress. I'm 6 feet, 175-180 lbs. Back and side sleeper. Very happy with it so far (about 3 months in). Edge support reasonable. Does run warmer than a spring mattress as expected, but doesn't bother me. Would buy again given value.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9701,
      "score": 0.9851,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Love this mattress",
      "review_text": "Been sleeping on the allswell supreme for a few weeks now. Let me just say, I'm IN LOVE. I'm 27 and a nurse and mom to a young toddler, my back was aching every day with my 8 year old traditional spring+pillow top mattress. I was doing most everything in my power to feel better, but nothing was helping... for months! I decided it was time for a mattress upgrade. From night 1 I noticed a difference. A few weeks later and I just noticed- no more ibuprofen, and heating pads every evening... I feel great! The only thing I can attribute it to is this new mattress. I'm still working just as hard and playing just as hard with my baby, but my back feels great! Some added bonuses I wasn't looking for but am loving: very minimal motion transfer- I can't even tell with my partner gets up, or even moves in the bed unless he's directly touching me. Also I had been warned about the smells with bed in the box, and I hardly even noticed any off-gasing smells at all. Maybe the first night, if you shoved your face into the bed, you could smell a slight chemically smell. But it wasn't bad or overpowering, kinda like a sharpie smell? Definitely didn't take long to disappear. Overall, would definitely recommend!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9395,
      "score": 0.9698,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Comfy Bed",
      "review_text": "I really enjoy this bed. It is not too firm and not too soft. The hybrid composition does not feel like memory foam but it shapes to my body. As a side sleeper, I feel like this bed gives me excellent alignment. I've looked at and tried beds that were much more expensive and found this to be equal in quality. The bed is the right thickness for my sheets and platform bed as well.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9543,
      "score": 0.9771,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Comfy!!",
      "review_text": "It's amazing, my husband & I are in love. Extremely soft, firm perfect combo. Also keeps us cool at night. What I absolutely love the most is that I cannot feel my husband move because he is a mover! 100% recommend & love this bed. If you're thinking about it then get it!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9836,
      "score": 0.9918,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Not firm enough for me.",
      "review_text": "I needed a firm mattress, and unfortunately this is not it. I was hoping I'd still feel \"on top\" of the mattress, but the memory foam top is too soft and makes me feel like I'm sinking in. Also, the edges of the mattress push down when you sit. I really wanted to love this mattress, but it just doesn't work for my sleeping style. I'm sure side sleepers or those that prefer a softer mattress would really enjoy it.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8302,
      "score": 0.0849,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Super Comfy",
      "review_text": "We really like our mattress. It is very comfortable and almost exactly what we wanted. There is a slight spring to it because it isn't just solely foam. The edge support is pretty good too. We have an infant and miss being able to bounce him in bed, but we knew that would not last forever so we chose this mattress. I think it is a keeper. It does run a little bit warm but it is winter now so I am not noticing it much. I am interested in seeing how it does in the summer months. I am always happy to lay down in bed. My back and hips don't hurt anymore and I am thrilled about that! We are side and back sleepers.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9695,
      "score": 0.9848,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "New mattress",
      "review_text": "It does feel very different to switch from a mattress and box spring to a new mattress that doesn't require a box spring. It takes a few days and then it feels GREAT. This was purchased for my daughter, she needed a new mattress for a long time. She has back and knee problems so I was very careful to select a high quality mattress. She is sleeping better and doesn't want to get out of bed because it is so comfortable.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9317,
      "score": 0.9658,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Good quality",
      "review_text": "I feel like the quality of the bed is excellent. My issue is the feel. It claims to be a medium feel but it's pretty soft. I feel a little sunken into the mattress and I'm 180 lbs. My girlfriend who is 120 lbs also says it feels soft to her. It might need more of a firmer foam on top.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.6703,
      "score": 0.8352,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great Bed - Still not used to mattress shipping",
      "review_text": "I really do love the bed! It is super comfortable and I no longer wake up with a sore back. My only complaint is that there is a section of the bed (of course on my side) that has a permanent fold from the packaging / shipping. I did wait 48 hours to let the mattress rise in hopes that the crease would go away, but it did not. I will see if it settles out over the next month or so and if not will reach out to the company. Other than that one minor item - the bed is AWESOME and so much more affordable than the other beds I was considering.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9162,
      "score": 0.9581,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great mattress!",
      "review_text": "[This review was collected as part of a promotion.] The ordering process was fine, but the delivery had a \"glitch\". Should have received it within two weeks, but upon investigation, apparently the label was damaged and mattress was returned to Allswell. Called Customer Service, Samantha K., she was great! Got it all straightened out and another mattress sent and received within a week. The box it arrived in was notsealed well. The tape on what should have been the \"bottom\" of the box, based on the arrows, was completely unsealed - all flaps could open. Thankfully, nothing was damaged and the tape on the rest of the box held. I give this only so the shipping tape, etc. can be improved upon for your future shipments. The mattress - GREAT!! My husband's word \"I felt like I was sleeping on a cloud\"; it is really comfortable and especially since we both sleep on our sides alot. We're \"technically\" seniors (don't \"think\" as a senior), so every once in a while these joints can get \"tricky\" in the shoulders and lower back - no problems so far - love it!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.7867,
      "score": 0.8933,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Stop researching and buy this one.",
      "review_text": "Literally the greatest thing I've laid down on in my life. I had a Tuft and Needle mattress for about 5 years before getting an Allswell. I thought I had a great mattress. Then this one was delivered. In 3 nights of sleep, my back pain is gone and I felt as though I could actually feel the stress in my hips unwinding the first night I slept on it. I will be telling everyone I know about this mattress. I put in roughly 5 hours of mattress research, driving myself bonkers, but this result was so worth it.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9481,
      "score": 0.9741,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Sound Sleeper - great quality",
      "review_text": "I am very satisfied with my new supreme queen mattress and will definitely recommend to others. There was a defect in the mattress cover and Allswell resolved the issue promptly with my complete satisfaction. Thank you Samantha K for your exceptional customer service!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9729,
      "score": 0.9864,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "So far, so good.",
      "review_text": "We've only slept on this for a total of 2 weeks, so my review is based on that. Firstly, the package arrived in a very badly damaged box and there was a slight rip on the top of the mattress after opening (and trust me, we were VERY careful cutting the plastic). As for the comfort level, it's definitely good so far. nice and firm when laying down but with a little cushion on the top. it's too soft for our preference at this time, but we were previously on a firm foam mattress so it's an adjustment that will need more time to see if its the best fit. So far, so good.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.8706,
      "score": 0.9353,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Allswell Supreme Mattress",
      "review_text": "I have been sleeping on my new Allswell Supreme mattress for about a month so far. The first night I felt like I was sleeping on a cloud after years of my old, too firm mattress. I was worried about the edges not being firm enough, but they are only slightly less supportive than my old, traditional mattress. I love this mattress so far! I have constant back pain due to an injury. I've been falling asleep faster and sleeping all night most nights compared to waking several times per night trying to get comfortable with my old mattress. I would recommend this mattress to anyone who has back pain or who wants a comfortable & supportive mattress. Just a side note, my two cats love it too! They have slept with me every night since I got this mattress.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.7648,
      "score": 0.8824,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Supreme King",
      "review_text": "So happy with our new mattress! After a week of sleeping on it, I noticed a huge difference in how well I was sleeping! With my old mattress I was constantly waking up, rolling over with a back ache. I'm no longer waking up multiple times throughout the night. Also customer service was amazing and helped with any and all questions! Highly recommend ALLSWELL!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9661,
      "score": 0.983,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "So Worth It!",
      "review_text": "[This review was collected as part of a promotion.] I first slept on an Allswell this past summer while visiting friends. My husband and I slept on it for a week and couldn't believe how comfortable it was and how well we slept AND how great we felt in the morning. So of course as soon as we got home we ordered one to replace the mattress we purchased just 2 years ago. The difference of how comfortable it is and how well we feel in the morning was so worth it!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9682,
      "score": 0.9841,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great Mattress Great Value",
      "review_text": "We bought two of these for the kids last year and they loved them. When it came time to replace our mattress and the guest mattress we looked at all options. This mattress is exactly what we were looking for. I was worried due to some reviews that said it was soft and you sink in. I did not find that to be the case at 260# supports me just fine. My wife is a Goldilocks and it is just right for her as well. Her back pain is GONE. I have nothing to compare it to other than my old mattress but glad I got this one instead of one that is 100s more. Can't imagine them being that much better.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9155,
      "score": 0.9578,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Finally Blissful Sleep",
      "review_text": "I am now getting wonderful and refreshing sleep since getting my Allswell Supreme Mattress! I appreciate both the combination of softness that puts me to sleep and firmness that supports my body so I wake up without stiffness or body aches in this 60 year old body! I have recommended to several of my friends who are looking for new sleep experiences. Great product Allswell!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9735,
      "score": 0.9868,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Love it",
      "review_text": "We really like this mattress. We had never had a memory foam mattress and were a little scared of how it would feel. For us, is the perfect combination between firmness and softness (I prefer mattresses not super firm). If you like yours firm, this might not be the one for you, but it's not super soft either. It clearly provides enough support for back and stomach sleepers.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9251,
      "score": 0.9626,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Mattress does not support your back",
      "review_text": "The Supreme was put forth as a hybrid that could be used with conventional box springs. I did not find this to be true. There is no support without a bunkie board. After adding a board, the mattress is still not supportive especially in the lumbar region. I am very disappointed in this product. For the price I could have bought a much more comfortable straight foam mattress and not have back pain every morning.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8869,
      "score": 0.0565,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great Mattress",
      "review_text": "Really surprised at the comfort of this mattress! I was going to have surgery and wanted a more comfortable mattress after the surgery and this has been a blessing! Great support, but soft and comfortable! I have had this for about 3 weeks and could not be happier with my purchase. Shipping information was provided and the mattress was delivered on time. Easy set up!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9781,
      "score": 0.989,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "If a mattress can hug you, the Supreme-King does!",
      "review_text": "The Supreme-King is a dream! Every night, it's as if it gives us a gentle welcoming hug. I haven't stopped saying how much I love it every night when we go to bed. The Supreme-King is the perfect firmness and softness all at the same time. I'm a back and side sleeper and my fiance is a side and stomach sleeper and it's so perfect for both of us! Do not hesitate. Buy this immediately and be ready for a great night of sleep!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9769,
      "score": 0.9885,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "The product was well priced, but was not as firm as what was expected, causing some body pain issues.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.7263,
      "score": 0.1368,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "I've only had it a few days. So far great but mattresses take time to assess and since this review was solicited, I give 3 stars",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9636,
      "score": 0.9818,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Bang for your buck!!!!",
      "review_text": "Love this matresss! Feels luxury!!!super thick me and my man love it!!!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9858,
      "score": 0.9929,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Best",
      "review_text": "I have three of these. I'll never buy a different brand.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9558,
      "score": 0.9779,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "bunchy",
      "review_text": "the very top layer bunches up and when you lay on it you can feel the creases and overlap. otherwise i like how it supports",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "neutral",
      "confidence": 0.6486,
      "score": 0.5,
      "roberta_label": "neutral",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Allswell King Mattress",
      "review_text": "Easy set up. Very heavy! Only expanded to 12 inches not 14 inches. Mattress is firm but comfortable. Great for the price!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9462,
      "score": 0.9731,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Too firm",
      "review_text": "Too firm for sensitive joints. Edge is also weak as stated in other reviews. I could feel thr coils so maybe a better pillow top.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.7308,
      "score": 0.1346,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "VERY comfortable value!",
      "review_text": "Easy out of the box setup. Super comfy for this back / side sleeper. And no disturbance from bed partner movement.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.967,
      "score": 0.9835,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Not comfortable .",
      "review_text": "Super firm and uncomfortable. Now I've got to figure out how to return this thing as there's no way it's going back in the box .",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8997,
      "score": 0.0502,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Returning",
      "review_text": "We do not like. Even for heavy people it is way too firm. Have not been able to sleep throughout the night on it",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8888,
      "score": 0.0556,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Heavy but worth it",
      "review_text": "This mattress is heavy and tricky to maneuver. Be sure to have a second person to assist. Comfortable mattress and expanded easily.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "neutral",
      "confidence": 0.5231,
      "score": 0.5,
      "roberta_label": "neutral",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "review",
      "review_text": "still trying it out but after 3 days i haven't got any back pain so so far so good. I like that its plush and its really cooling.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9252,
      "score": 0.9626,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Disappointing Walmart Experience",
      "review_text": "Product came with scratches all over. Also it had grease stains all over the Matress. I'm not able to bring back nor have the Matress picked up because of my situation. And Walmart wouldn't even offer a refund.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.9473,
      "score": 0.0264,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great purchase!",
      "review_text": "This mattress is exactly what the description says! I love it so much. It's super easy to unpack, and we barely had to wait for it to fluff up to the full size. It's a perfect firmness.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.982,
      "score": 0.991,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "medium firmness",
      "review_text": "in the firmness rating, it was a medium. However, this should be a step above medium. maybe a medium . It took a few days to air out. It has nice edge support. it is quite comfortable.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.6216,
      "score": 0.8108,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great mattress",
      "review_text": "When I read that Walmart was the first to implement \"mattress in a box\" I thought I'd try it. The box springs were a surprise, and I needed help with that. The mattress has provided a perfect sleep every night, so I highly recommend it.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9564,
      "score": 0.9782,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "I think i really comfy",
      "review_text": "I was hesitant to buy because I wanted cheaper, but to be honest I do not regret buying it, it is comfortable, not too soft not to hard, it has a little plastic smell when first comes, but it goes away with time",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.8813,
      "score": 0.9407,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Very impressed..",
      "review_text": "I am very impressed, my wife and I are side sleepers and this mattress is perfect. Good Job WM.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9857,
      "score": 0.9929,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "It will take a few weeks to tell how good the bed is",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "neutral",
      "confidence": 0.5637,
      "score": 0.5,
      "roberta_label": "neutral",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "I wish it was a little softer, said medium firm but it is pretty firm to me!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.5765,
      "score": 0.7882,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Online Purchase",
      "review_text": "Replaced our mattress with this due to backaches in the morning. The satisfaction guarantee made the decision to purchase online easy. We intend to assess the choice at 6-8 weeks of use, we'll rate 4 stars after 2 weeks of use.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.5372,
      "score": 0.7686,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Doesn't work for me",
      "review_text": "This appear to be a well-made mattress but unfortunately it is too firm for me. I'm trying to schedule a pickup which hasn't been as straightforward as I'd hoped.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.89,
      "score": 0.055,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "1942499888",
      "product_url": "https://www.walmart.com/ip/The-Allswell-Supreme-14-Bed-in-a-Box-Hybrid-Mattress-Queen/1942499888?variantFieldId=bed_size&classType=VARIANT&from=/search",
      "product_name": null
    }
  ],
  "scraped_at": "2025-10-21T01:57:40.086000"
}