{
  "product_id": "2862955510",
  "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
  "product_name": null,
  "reviews": [
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Buy this chair!",
      "review_text": "Run. Don’t walk to buy this chair. Easy to put together and so comfortable. All other colors are microfiber- ish. We decided on fade because it’s corduroy type and more ‘durable’ because we have pets. This chair is absolutely amazing. So amazing. I plan to order two more. I am serious when I say run do not walk. Buy this chair.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9611,
      "score": 0.9806,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Just as good as they say!",
      "review_text": "It’s even better in person! I was very impressed with the fabric quality- it’s a very nice boucle! It’s comparable to PB boucle just not as soft but it loos like it’s going to be durable. It fits two adults sitting or very comfortable for a mom and a pair of toddlers :). The only negative is that it had a few dirty spots from the factory or a return! It came off with a wet microfiber cloth.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9772,
      "score": 0.9886,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Pink lovers buy now!!",
      "review_text": "Love this chair, and it comes in pink! I was hesitant to purchase without seeing any purchase reviews in this color. ZERO regrets! I love the color, it’s soft and warm. Assembling was a breeze, you do need two people to put together. Delivery was great as well! Thanks Drew 🩷",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9827,
      "score": 0.9914,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Drags a little, but amazing quality and size",
      "review_text": "This chair is so stunning! I love how beautiful it is, it has really good quality, and I love that the pillows have zippers. That will make it easy to wash. The only issue I had was that it has trouble spinning around when I lean all the way back in it. It’s like it drags in the back a little. Other than that, it’s amazing. It is way bigger than I imagined it would be, which I love! I love this brand and this chair does not disappoint.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9721,
      "score": 0.986,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Stunning swivel chair",
      "review_text": "Absolutely in love with our new swivel chair! It’s not just a piece of furniture; it’s a whole vibe. The perfect blend of comfort and style, it’s quickly become my favorite spot in the master bedroom. Whether I’m enjoying a morning coffee or unwinding with a good book, this chair has made the space feel so much more cozy and inviting. Highly recommend it to anyone looking to elevate their room!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9861,
      "score": 0.993,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Such a deal!",
      "review_text": "I am shocked everyday I look at these two chairs. I had two picked out at Pottery Barn that were triple this price. I thought if I get them and don’t like them I will give them to my grandson. I send pics to everyone saying can you believe I got these chairs for this price. So come and look so good. Amazed by the quality. It took 10 minutes to set them up so easy.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.6281,
      "score": 0.8141,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Elegant and classy chairs",
      "review_text": "It looks so beautiful. So classy and elegant. I sprayed mine with scotch guard to protect it. The color is so nice, looks more like a white to me and not cream but I still love it. It’s so comfortable and you can have a nice relaxed day just watching tv or reading. It’s very comfortable. What I also don’t protect it’ I put a white towel over the chair while I sit on it. So don’t let the color discourage you from getting the cream color, you won’t regret it. It’s also great that it swivels. I’m in love with my chairs.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9666,
      "score": 0.9833,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "You guys are *****. You left my package sitting down in the driveway when I specifically said put it on the porch. I don’t really care what the chair looks like now it’s 88 pounds and I’m 70 years old and I can’t get it into my house I spent 45 minutes on the phone with your representative. Got nowhere and ended up hanging up",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.9297,
      "score": 0.0351,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "REFUND NEVER ISSUED",
      "review_text": "Be warned. I ordered a chair that was defective. I contacted the manufacturer first, they were wonderful, but advised the only solution was to return since the arm/part that needed to be replaced was on backorder. I called Walmart.com customer service and a freight company called Estes picked up the item from my front door on May 28. Walmart.com has no record of the pickup. Our security cameras have the entire event recorded. I called Walmart.com Monday and was promised my money would be refunded. it has not. Called Estes today 15 days later explaining there is no record on Walmart.com of them even picking the item up. I was told just wait 24-48hrs and I can contact Walmart back. It seems I am not the only person with this issue. I did my part, and someone is holding my refund hostage. DO NOT BUY!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.6868,
      "score": 0.1566,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "The chair has NOT BEEN DELIVERED. The order has been cancelled three times. According to the walmart.com customer service reps that we've contacted each time, the issue lies with the 3rd party delivery agent. If Walmart is going to be the exclusive seller of this chair, then you must have a REPUTABLE delivery agent to follow-thru. There are multiple comments on the internet about the similar delivery issues. this is unacceptable from a National Retailer to have this type of poor order fulfillment rate!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8801,
      "score": 0.06,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "I really, really wanted to love this chair, but I don't and can't! This chair is beautiful, but it is sooo uncomfortable! The gray fabric is rough - really, truly rough. Nothing soft about it at all! I read all the reviews before I bought it and figured those who said it's rough were just being nitpicky. They were not! It's rough and uncomfortable to the point that I can only sit on it if I have a blanket over it. And it is*not* the perfect chair for a reading nook! The back is way too short to settle in and get comfy to read. I have to slouch way down and pile up the pillows just right behind my head for support, and it's still not comfortable. I can, however, see that this would be a great chair (or chairs, if you need multiples) for a sitting/conversation area where everyone will be sitting upright and, presumably, fully dressed. It has a maximum load weight of 225 lbs, so many big and/or tall people will exceed the weight limit. Something to consider if you're purchasing it to have company over. The instructions say you must have two or more people to assemble it, but I have janky shoulders and was able to assemble it by myself, so two people aren't absolutely necessary. I don't necessarily not recommend it, but I only recommend it for certain situations. This is not the chair for snuggling in for a cold, rainy day of reading and relaxing.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8617,
      "score": 0.0691,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Buy the Chair!",
      "review_text": "I have debated this chair for months, and I am so glad I finally purchased it. It looks high-end at such an amazing price, and it goes great with any decor. It is comfortable, and I love the swivel. It was super easy to assemble, which is a huge plus. You literally can't go wrong with this chair!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9864,
      "score": 0.9932,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Beautiful chairs!!",
      "review_text": "So I went back and forth on the dark gray and white. I normally always always veer towards white, I got the dark gray to change things up a bit and I am soooo glad I did. Although you can't go wrong with either. The dark gray is a beautiful color and complimented my room very nicely! Super comfy and I don't have to worry about being a spaz about the possibility of stains on the white",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9751,
      "score": 0.9875,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Look great, but super uncomfortable",
      "review_text": "This is the first time I've felt compelled to write a product review. I'd like to first say that my wife and I really wanted to like these chairs (we bought two). The chairs are attractive and are reasonably priced. At first, we also found them relatively cozy. However, as time has gone on we have come to the conclusion that these are the most uncomfortable chairs we have ever owned. The seat bottom is extremely hard. We thought the bottoms might soften somewhat over time, but they have not. My wife has taken to sitting on a pillow when using the chair. In addition, the back being composed of three separate pillows seems like a good idea, but in practice it's a pain (literally). Every shift in position requires moving the pillows and it's difficult to find a consistently comfortable position. The back/pillows are also relatively low, meaning there is inadequate back support. Finally, the seat height is low. If you use the chair with an ottoman, your feet tend to be higher than your backside, resulting in an awkward sitting position. We have given up trying to make due with these chairs and are currently looking for new ones.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.3663,
      "score": 0.3168,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "Love the size. The color is tooooooo white to be labeled as cream. But it's growing on me. One thing Drew Barrymore can you please make decorative chair covers for this item greatly appreciated sincerely Lady T.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9552,
      "score": 0.9776,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Gorgeous chair",
      "review_text": "Love this chair, I was just super worried about it being so white. I found my daughter going to touch it and I was like no! Then I knew I needed the dark gray ones. With that said this chair is gorgeous and super comfortable. You can curl right up into it. For me I was just too worried about keeping it clean with kiddos! But no worries with the dark gray! Drew did another great job!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.5846,
      "score": 0.7923,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Missing pieces. Lacking customer service",
      "review_text": "Received the chair but pieces were missing. We are unable to put the chair together. Spoke with customer service and they said they would send me a new chair the following day, to dispose of the chair with the missing pieces. Called customer service and was told that they were unable to send a new chair because they were out of stock and offered a refund. Before accepting the refund I saw that the chair was NOT out of stock. So I was then told that the chair would be delivered the next day. Then I was told it would only be delivered if I give them the damaged chair. Which I had already disposed of as told by customer service. They also refused to give me a refund which I was offered earlier. Someone in the customer service department needs to retrain the workers to be honest and not make promises that they know they won’t keep. I’m very sad and disappointed for the dishonesty.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.7778,
      "score": 0.1111,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great Quality Comfort Chair",
      "review_text": "It’s a very beautiful chair. Comes in one big box which I had to open outside the door. Has 4 pieces to put together which only took about 15-20 mins. Love the quality %26 comfort. The cushion is deep enough to fold up my legs which I love.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9727,
      "score": 0.9864,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Cute chair but smells so horrible!",
      "review_text": "The chemicals sprayed on this chair make my entire room smell disgusting. Didn’t even realize it was sprayed with formaldehyde until after I put it together. Great design though!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8853,
      "score": 0.0574,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "AMAZING!!!",
      "review_text": "BEAUTY-FULL!!! Comfortable! Well-made. it fits perfectly in a cozy reading nook in my bedroom. Beyond satisfied with this purchase! Highly recommend! :)",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9897,
      "score": 0.9948,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "I’M IN LOVE",
      "review_text": "These chairs are so beautiful in my home! I couldn’t be more pleased with the design, quality and how stunning my home looks with them!!! I can’t wait until I complete it.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9896,
      "score": 0.9948,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Happy cat",
      "review_text": "Well, my cat likes it. Honestly, I guess that is what matters most! I got to lounge in it once so far and I will be buying another one in the future for sure!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9799,
      "score": 0.9899,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "No go for cat owners",
      "review_text": "This review is for the cat owners. This fabric is horrible for cat claws. My cats shredded this within a week of setting it up. I would not recommend to cat people. However, it is comfortable and I can see why people like it",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8293,
      "score": 0.0853,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Literally beautiful!",
      "review_text": "If you have been looking at this chair, just get it! I had done a lot of research on several swivel chairs for my bedroom and I kept coming back to the Drew. Beautiful chair. For my bedroom aesthetic, I wanted the FAWN color, but it was chronically out of stock until, in the middle of one random night, I checked, and it was in! I ordered two of them immediately. They shipped quickly, and I got them within a few days. Set up was great, no issues. The size, look and comfort are exceptional. I was a little iffy about getting a corduroy chair, but it looks really cool and the fabric is very soft.. I wanted a chair that my husband would be comfortable in, and this one is perfect. As other reviewers had noted, there is a pink or mauve undertone in the FAWN color. But it is definitely more tan or beige than pink and, depending on lighting, you don’t see the pink at all. These chairs are perfect to watch the sunrise from our bedroom window and swivel around to watch the morning news. Super practical and literally beautiful.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9689,
      "score": 0.9844,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Beautiful Chair by Drew-Fawn",
      "review_text": "This chair is absolutely incredible! It’s big enough to curl up in, but still compact enough to fit in any space. I looked for a chair like this everywhere and this was definitely the most affordable option, especially since the quality is outstanding. Putting it together was a little bit difficult, because you have to line the sides up just right, but once we nailed that it was perfect!! I absolutely love the fawn color and ribbed material. 10/10 would recommend. BUY IT!!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9796,
      "score": 0.9898,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Beautiful, yes!",
      "review_text": "Overall, this couch is beautiful and comfortable. I was skeptical on ordering the color fawn due to no previous real pictures of customers, however I still went for it and as I imagined the color didn’t match my eyes. This color gives a pink hue, however, it is a beautiful color. In the room it’s surrounded by brown tones, so that may be the issue yet now I need to wait for the cream couch to get back in stock. I want to note the corded look is nice! I just don’t find it working for my space. Overall assembly was easy and again the couch itself is soft and comfortable, but the color didn’t meet expectations which is why I didn’t give it full stars. Hopefully I get to exchange for the cream when it gets back in stock.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.668,
      "score": 0.834,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Lives up to its name: Beautiful!",
      "review_text": "a beautiful, comfortable, functional chair at an affordable price. the color and style is perfect for the beach theme I was going for. the firm seat is not too firm, and the back pillows can be moved around for the most comfortable setting position. the 360° swivel capability means you can place the piece almost anywhere. assembly is pretty easy, but will require two people to position the back onto the base.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9796,
      "score": 0.9898,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "Fedex could not or would not deliver this chair to my house. they kept saying out for delivery for a week, then a woman from meridian ms called to tell me that my item was still there at the facility,she continued by saying the item weighed 89 lbs and she was going to check on this and call me back, she didn't call back. I tried calling her back, but the number could not be reached. back and forth with CS from walmart and CS fedex, no chair, but we are sorry for your inconvenience. It was stated over and over, day after day, until I realized no chair would be coming. Fedex failed walmart, and walmart failed me. I'm sure the chair would have been beautiful, and the price was excellent for those lucky enough to receive it. now, if walmart shipped with ups, I would be sitting in my chair and enjoying it. UPS delivers in my neck of the woods. Fedex allows its drivers to decide where and if a delivery is fit to be moved. I'm old enough to remember when K-mart was king and wal-mart was an infant. you are king now walmart how much longer will you rein. I'm going to take a look at some other discount stores... who!! like you were, once upon a time, an infant just trying to grow. a small store trying to survive and had the best of everything customer oriented, so thanks for your service of yesteryear.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.7686,
      "score": 0.1157,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Since you don't reply 2 emails. Unacceptable!",
      "review_text": "This is completely unacceptable. I live in a NYC high rise with a doorman and exceptional package acceptance service, which logs every single delivery into the building. They have ZERO record of this being delivered. It’s also interesting that upon dispute of this, Federal Express actually went into their system and changed important details of the delivery, including the actual delivery date. They clearly are in error and at fault. I wonder why this isn’t being taken up with your actual delivery service Federal Express, as I see these chairs being offered all over Facebook Marketplace in my area, new and in box at reduced rates. You have to wonder if they are being stolen by actual Federal Express workers and then re-sold. I should not and will not dispute this with my bank. Your staff already told me on a phone call yesterday that I was being sent a new chair. So, are you now telling me Walmart is now not standing by what was already promised to me? You can refer back to that call that took place yesterday. I am sure it was recorded. I was told that a replacement would be sent between Jan 11 and Feb 11, and I would receive an email confirmation, which I have yet to receive. Would you like to speak to the package delivery service, which is provided by my building to confirm that ZERO package was delivered here. Walmart chose to deliver a $300 plus item without getting signature confirmation or even a photograph of where it was delivered. Even Amazon does that. That was NOT my choice. This fault falls on Walmart and Federal Express and I should and will receive a refund from Walmart for an item that was not received. Margo Osborne",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.7961,
      "score": 0.102,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Buy this chair now",
      "review_text": "I bought the sage green and it is beautiful! I put it together myself in less than 30 minutes after watching a YouTube video. It’s extremely comfortable and I can easily curl my legs under me with plenty of room to spare. I cannot believe the overall quality of this chair, and for less than $300!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9802,
      "score": 0.9901,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "I want you to know that WALMART is the worst for delivering orders, they are. Disorganized, I have been trying for 1 month to get some Drew Barrymore chairs. I have ordered them twice and they always get the address wrong and the solution is to refund the money. I don’t know how people buy from them. Terrible service. This is very frustrating that only you have the Drew Barrymore sale.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.9432,
      "score": 0.0284,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Not worth the trouble!",
      "review_text": "First… I had to FIGHT with Fed Ex to get this chair delivered, after contacting Walmart twice with ZERO resolution from them. Walmart prints a label saying 40lbs, when the chair weighs 112. So note delivery may be a battle for you too. THEN it finally gets delivered, and I have TWO right hand modules and NO left hand module. I’m so over it. I’m over Walmart and I’m over this chair.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8949,
      "score": 0.0526,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "Be aware if you will be delivered a wrong color it would take Walmart an eternity to send you a replacement, even though it’s not your fault!!!!! Awful customer service!!! Ordered this chair to get it before my baby is born to use it in my nursery ,now it’s never gonna make it.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.9394,
      "score": 0.0303,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "\"Beautiful\" is the right word!",
      "review_text": "The price / value of this chair is outstanding. I ordered two because of a sale and I am very pleased. The construction on this chair is heavy duty, not some particle board junk. Each chair comes in one box and the box is pretty heavy. The delivery was to my front sidewalk! I opened the boxes outside and brought in the pieces one by one which worked fine. Assembly was pretty straightforward and the instructions were very simple and the hardware was packaged well. I assembled them by myself and it took about 20 minutes for the first one and a little shorter on the second. No problems with damaged boxes and the packaging was great! Delivery time was very fast, with my order being placed late on December 1 and delivery on December 5! As other reviewers have pointed out, comparable chairs at other retailers are double what this chair sells for. If you are looking for this type of style chair, I highly recommend purchasing this one. Great job, Drew!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9747,
      "score": 0.9873,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Nice but uncomfortable and difficult to swivel.",
      "review_text": "Aesthetically this chair is nice, but it is not comfortable and the backrest rubs on the ground making it difficult to swivel unless you scoot all the way to the front edge of the chair. I got this chair on sale so I'd say it was a good deal but if I had to pay full price then not so much.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.7431,
      "score": 0.1285,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Not stain resistant at all",
      "review_text": "I do truly love these chairs. The reason I only gave 3 stars is for 2 reasons. First, they are advertised as having stain resistant fabric and that is far from the truth. Would not recommend these for anyone with kids or pets, I have both. Second, I had to exchange one of the chairs because the frame was defective and the exchange process was an absolute nightmare and took over a month to get a new chair. All that said, I do love the look of these chairs and they are super comfortable.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.5028,
      "score": 0.2486,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great reading chair!",
      "review_text": "The chair is very easy to assemble. It looks great in my living room and is very comfortable. it is sturdy, and the material is thick. Great quality for the price. My only complaint is FedEx left the package at the end of my drive by the road. I had to lift it in the back of my truck and bring it back my drive.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9628,
      "score": 0.9814,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Product came Stained... poor customer service",
      "review_text": "I was delivered a stained and dirty product, we noticed it immediately while removing the pieces from the box. Started the return process within minutes of receiving the product. After 20 mins of back and forth, before I finally got a return accepted. I had to wait 3 days before FedEx would pick it up (7am - 2pm) window. After 2pm with no communication or information I reached out to Walmart - no update, they have no idea where FedEx is, I should just keep waiting is what I am told. I cannot continue to wait. So we reschedule, I have to wait another 3 days before... maybe.. hopefully FedEx comes to get it. Can they send a replacement now - No! Do I get a credit - No! Do I get anything for this trouble - No! Amazing. I receive a product with a large grease or oil stain and now I get to wait another week before I can get someone to pick up the product, then after they have processed it, then I will get sent my product. This is the last time I purchase furniture from Walmart.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.8733,
      "score": 0.0633,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Nice chair, expensive shipping fees not so much",
      "review_text": "The chair itself is beautiful. Easy to put together, my 8 year old son helped me assemble it and only took about 15 minutes per chair. Not happy with Walmart though. When ordering it had no free shipping, so had to pay $100 in shipping but reallllyyyy wanted the chairs. The next day it went to free shipping and they won’t refund the shipping fees I paid. Wouldn’t have ordered if I knew it was going to go to free shipping. Can’t return to get shipping cost back. Customer service rep I talked to was nice but they couldn’t help me since Walmart wouldn’t let them lol. Love the chair, not so much Walmart. Probably won’t order from Walmart.com for furniture again. So if you’re wanting to order the chair and it has a shipping fee, just be patient until it goes to free shipping.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.4877,
      "score": 0.2562,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "Beautiful Chair! However the Chair was delivered with 2right arms, and completely unusable. Had to go through obstacles to get the chair picked up and still waiting on my replacement. This is my first time purchasing furniture from Walmart and my last! I was hoping the chair would be in my new apartment before Christmas, but will now be here most likely after. I have no words!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.7791,
      "score": 0.1104,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "I had read the reviews for this chair, which were mostly 4s and 5s but there were some 1s. For the price it was definitely a 5 for me. I realized that out of the thousands of chairs shipped there are going to be a few unhappy people. But everything mentioned in the 1 reviews were not true for my experience. The chair was in pristine condition in solid packaging and very easy to assemble. And it not only looks stunning but welcomes anyone to curl up in it with a good book or just to relax.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "neutral",
      "confidence": 0.4474,
      "score": 0.5,
      "roberta_label": "neutral",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Drew Barrymore Swivel Chair",
      "review_text": "I love Drew’s furniture. A throw back furniture style %26 so me :) I wanted a chair so badly but there were only a couple colors. I was elated when she dropped the brown chair! It’s beautiful!! When people visit they always compliment everything Drew. I love the brand.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9825,
      "score": 0.9913,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "Absolutely love these! I got 4 of them for a sitting area and get compliments all the time! They look amazing and are super comfortable too!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9892,
      "score": 0.9946,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "",
      "review_text": "I love this chair SO much, but I got it in white %26 cannot keep it clean for the life of me. It is SO frustrating. They are so cozy, oversized, and comfortable, but you will have to clean them alll the time.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "negative",
      "confidence": 0.82,
      "score": 0.09,
      "roberta_label": "negative",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "In LOVE!!!",
      "review_text": "I’ve been eyeing this chair for years but never had the room until now! I LOVE this chair and just purchased a second one for our living room. Do not hesitate to purchase. The assembly was so easy and the quality is great.",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9866,
      "score": 0.9933,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "OBSESSED!!!",
      "review_text": "This chair is a must!!! My hubby and I can both fit and it’s in our master. 11/10. Drew outdid herself!!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.9865,
      "score": 0.9932,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    },
    {
      "reviewer_name": "Anonymous",
      "rating": null,
      "title": "Great looking, cute and comfy chair",
      "review_text": "Ordered as a gift for my daughter-in-law’s birthday. She loves it! Easy to assemble and comfortable!",
      "date": "",
      "verified_purchase": false,
      "helpful_count": 0,
      "sentiment": "positive",
      "confidence": 0.989,
      "score": 0.9945,
      "roberta_label": "positive",
      "method": "roberta",
      "product_id": "2862955510",
      "product_url": "https://www.walmart.com/ip/Beautiful-Drew-Chair-by-Drew-Barrymore-Cream-Boucle/2862955510?classType=VARIANT&athbdg=L1102&from=/search",
      "product_name": null
    }
  ],
  "scraped_at": "2025-10-21T02:22:47.385376"
}